twitter-clone/app/controllers/statuses_controller.rb

SELECT * FROM "statuses" WHERE ("statuses".user_id = 1)
SELECT * FROM "users" WHERE (UPPER(login) = 'USER2') LIMIT 1
---
  def index
    @statuses = User.find(params[:user_id]).statuses.all

SELECT * FROM "users" WHERE ("users"."id" = '2') LIMIT 1
INSERT INTO "statuses" ("created_at", "replyto_id", "updated_at", "user_id", "content") VALUES('2009-09-01 06:34:34', NULL, '2009-09-01 06:34:34', NULL, 'test')
UPDATE "users" SET "updated_at" = '2009-09-07 20:34:39', "perishable_token" = 'dhKgcPp6sBGjyVnO_4TT', "last_request_at" = '2009-09-07 20:34:39' WHERE "id" = 2
---
  def create
    @status = Status.new(params[:status])
    @status.user = User.find(params[:user_id])
    if @status.save

SELECT * FROM "statuses" WHERE ("statuses"."id" = 1)
---
  def show
    @status = Status.find(params[:id])