twitter-clone/app/controllers/statuses_controller.rb

INSERT INTO "statuses" ("created_at", "replyto_id", "updated_at", "user_id", "content") VALUES('2009-09-11 05:31:23', NULL, '2009-09-11 05:31:23', 1, ' post
---
  def index
    if request.post?
      @status = Status.new(params[:status])
      @status.user = @user

      if @status.save