twitter-clone/app/controllers/users_controller.rb

INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "following_id", "email") VALUES('oz0RMJLfAWXB64BxxSx5', '2009-09-07 08:45:39', '2009-09-07 08:45:39', 'afe02aa46d7781d603d17f4c9f3bee72d72647537f28e3c2d1a78382ce3394e26fd41e605a0e0d85d0a39c70e4c217c6076a97b7afeee0d08aca1e7556a3539a', 'LqF23LjFgfAfX2K8Kr5j', '2009-09-07 08:45:39', 0, '127.0.0.1', 'BrH3X8fuGI6q-lpKLiCs', '2009-09-07 08:45:39', 'ceea1d4eb880105abda3e8c676997d9fde77e094b69e46cb1eef74c6c07f1e57b0a478096197595a3494feab9c927b0ade98c6f67d7d456649d9936e638e201e', 1, NULL, 'User2', NULL, NULL, 'test@test2.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "updated_at" = '2009-09-14 06:24:58', "perishable_token" = 'pp7pnj8D1wyS-H9VxL4N', "last_request_at" = '2009-09-14 06:24:58' WHERE "id" = 1
---
  def follow
    @user.add_follower(@current_user)
    @user.save

UPDATE "users" SET "updated_at" = '2009-10-03 07:04:31', "perishable_token" = '7-yQh9Xx48EhRmFjy1wN', "last_request_at" = '2009-10-03 07:04:31' WHERE "id" = 6
---
  def remove
    @user.remove_follower(@current_user)
    @user.save